Revit 2021.1 API
Units Methods
The Units type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormatOptions(ForgeTypeId)
 Gets the default FormatOptions for a spec.
GetFormatOptions(UnitType) |  Obsolete.
 Gets the default FormatOptions for a unit type.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModifiableSpecs
 Gets all specs for which the default FormatOptions can be modified.
GetModifiableUnitTypes |  Obsolete.
 Gets all unit types for which the default FormatOptions can be modified.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsModifiableSpec
 Checks whether the default FormatOptions can be modified for a given spec.
IsModifiableUnitType |  Obsolete.
 Checks whether the default FormatOptions can be modified for a given unit type.
SetFormatOptions(ForgeTypeId, FormatOptions)
 Sets the default FormatOptions for a spec.
SetFormatOptions(UnitType, FormatOptions) |  Obsolete.
 Sets the default FormatOptions for a unit type.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Units Class
Autodesk.Revit.DB Namespace